# 定义函数f，实现将一个十六进制数转换为十进制数的功能。
# 函数原型：f(n)，n表示一个十六进制数，由0-9.A-F中的若干个符号组成，其中A-F分别表示10-15。
# 转换方法：各位数字分别乘以相应位上的权，并累加求和。
# 例如十六进制7A3转换为十进制的过程为：7*16**2+10*16**1+3*16**0
# 样例：
# 输入：
# f("7A3")
# 输出：
# 1955


# int()内置函数
def f(num):
    return int(num,16) # 内置的十六进制转换十进制


# 题意算法
def f(num):
    result = 0
    data = {"1":1,"2":2,"3":3,"4":4,"5":5,"6":6,"7":7,"8":8,"9":9,"A":10,"B":11,"C":12,"D":13,"E":14,"F":15}
    for i in range(len(num)):
        result += int(data[num[-i-1]])*16**(i)
    return result


print(eval(input()))
